package uz.dataFin.notificationbot.utils;

public interface Constant {
    String MY_PHONE_NUMBER = "\uD83D\uDCDE Менинг рақамим";
    String ENTER_MARKET_NAME_BTN = "Market qo'shish";
    String CHOOSE_PERIOD = "⏰Даврни танланг:/⏰Выберите период:/⏰Davrni tanlang:";
    String NO_PERMISSION = "Буйруқдан фойдаланишга рухсат йўқ!/Команда не разрешена!/Buyruqdan foydalanishga ruxsat yo`q!";
    String NO_BALANCE = "Сизда баланс бўйича ҳеч қандай маълумот мавжуд эмас!/У вас нет информации о балансе!/Sizda balans bo`yicha hech qanday ma'lumot mavjud emas!";
    String PRODUCT404 = "Ушбу маҳсулот ҳақида маълумот топилмади!/Информации об этом товаре не найдено!/Ushbu mahsulot haqida ma’lumot topilmadi!";
    String ALREADY_REGISTRATION = "Рўйхатдан ўтиш муваффақиятли якунланди✅\nCиз ҳақингизда ҳеч қандай маълумот топилмади!\nМаълумотларингиз тасдиқланишини кутинг./Регистрация завершена успешно ✅\n Информация о вас не найдена!\n Подождите, пока ваша информация будет проверена./Ro‘yxatdan o‘tish muvaffaqiyatli yakunlandi✅\nSiz haqingizda hech qanday ma’lumot topilmadi!\nMa’lumotlaringiz tasdiqlanishini kuting.";
    String CONTRACTOR = "Сиз контрагентлар рўйхатига қўшилгансиз!\n" +
            "Қуйидаги буйруқлардан бирини танланг!/Вы добавлены в список контрагентов!\nВыберите одну из команд ниже!/Siz kontragentlar ro‘yxatiga qo‘shilgansiz!\nQuyidagi buyruqlardan birini tanlang!";
     String EMPLOYEE = "Сиз ходимлар рўйхатига қўшилгансиз\n\nКеракли маҳсулот коди ёки штрих кодини киритинг.../Вы добавлены в список сотрудников\n\nВведите необходимый код продукта или код штрих.../Siz xodimlar ro‘yxatiga qo‘shilgansiz \n\nKerakli mahsulot kodi yoki shtrix kodini kiriting...";
     String REGISTRATION = "Aссалому алайкум!\n▪Рўйхатдан ўтиш учун телефон рақамингизни юборинг.../Привет! \n▪Отправьте свой номер телефона для регистрации.../Assalomu alaykum\n▪Ro`yxatdan o`tish uchun telefon raqamingizni yuboring...";
     String NO_INFO_ROLE = "Сиз ҳақингизда ҳеч қандай маълумот топилмади!\nМаълумотларингиз тасдиқланишини кутинг./О вас не найдено никакой информации! Подождите, пока ваша информация будет проверена./Сиз ҳақингизда ҳеч қандай маълумот топилмади!\n" +
             "Маълумотларингиз тасдиқланишини кутинг.";
    String ERROR_500 = "Сервер билан хатолик юз берди ботСервиcе.сенд404/Произошла ошибка с сервером botService.send404/Server bilan xatolik yuz berdi botService.send404";
    String ERROR_CHOOSE_DATE = "❌Давр танлашда хатолик юз берди!\nЖараённи қайтадан бошланг.../❌Ошибка в выборе периода!\nЗапускаем процесс заново.../❌Davr tanlashda xatolik yuz berdi!\nJarayonni qaytadan boshlang...";
    String CHOOSE_FORMAT = "Маълумотларни қайси форматда қабул қилмоқчисиз?/В каком формате вы хотите получить данные?/Ma’lumotlarni qaysi formatda qabul qilmoqchisiz?";
    String AKT_SVERKA = "\uD83D\uDCC5АКТ СВEРКА/\uD83D\uDCC5АКТ СВEРКА/\uD83D\uDCC5AKT SVERKA";
    String AKT_SVERKA_TOVAR = "\uD83D\uDCC5АКТ СВEРКА (товар)/\uD83D\uDCC5АКТ СВЕРКА (товары)/\uD83D\uDCC5AKT SVERKA (tovar)";
    String BALANCE = "\uD83D\uDCB0БАЛАНС/\uD83D\uDCB0 БАЛАНС/\uD83D\uDCB0 BALANS";
    String TODAY = "Бугунги кун/Сегодня/Bugungi kun";
    String WEEK = "Ҳафта/Неделя/Hafta";
    String MONTH = "Ой/Месяц/Oy";
    String QUARTER = "Квартал/Квартал/Kvartal";
    String YEAR = "Йил/Год/Yil";
    String OTHER = "Бошқа.../Другой.../Boshqa...";
    String CHOOSE_START_DATE = "Бошланғич санани танланг.../Выберите дату начала.../Boshlang‘ich sanani tanlang...";
    String START_DATE = "⏰Бошланғич сана -> /⏰Дата начала -> /⏰Boshlang‘ich sana -> ";
    String END_DATE = "⏰Охирги сана -> /⏰Дата конец -> /⏰Oxirgi sana -> ";
    String CHOOSE_END_DATE = "Охирги сана танланг.../Выберите дату конец.../Oxirgi sana tanlang...";
    String SETTINGS = "⚙️Созламалар/⚙️Настройки/⚙️Sozlamalar";
    String IMAGE = "Расм/Картинка/Rasm";
    String CHOOSE_LANGUAGE = "▪️Тилни танланг.../▪️Выберите язык.../▪️Tilni tanlang...";
    String CHANGE_LANGUAGE = "\uD83C\uDF0DТилни ўзгартириш/\uD83C\uDF0DИзменить язык/\uD83C\uDF0DTilni o`zgartirish";
    String CHANGE_TYPE_FILE = "🗃Файл форматини ўзгартириш/🗃Изменить формат файла/🗃Fayl formatini o`zgartirish";
    String CHANGE_TYPE_FILE_200 = "✅Файл формати ўзгартирилди: /✅Формат файла изменен: /✅Fayl formati o`zgartirildi: ";
    String CHANGE_LANGUAGE_200 = "✅Система тили ўзгартирилди: /✅Изменён системный язык: /✅Sistema tili o`zgartirildi: ";
    String TO_BE_CONTINUED = "Жараённи давом эттиришингиз мумкин!/Вы можете продолжить процесс!/Jarayonni davom ettirishingiz mumkin!";
    String MAIN_MENU = "Қуйидаги буйруқлардан бирини танланг.../Выберите одну из команд ниже.../Quyidagi buyruqlardan birini tanlang...";
    String BACK = "🔙Асосий менюга/🔙В главное меню/🔙Asosiy menyuga";
    String YES = "Ха/Да/Ha";
    String NO = "Йўқ/Нет/Yo'q";
    String ACCEPT = "Сиз операцияни тасдиқладингиз✅/Вы подтвердили операцию✅/Siz operatsiyani tasdiqladingiz✅";
    String REJECT = "Операция рад етилди\uD83D\uDE45\u200D♂\uFE0F/В операции было отказано\uD83D\uDE45\u200D♂\uFE0F/Operatsiya rad etildi\uD83D\uDE45\u200D♂\uFE0F";
    String REQUEST_URI = "http://91.219.62.18/xonchiroq_test/hs";
}
